import importlib
import sys

import jieba
from wordcloud import WordCloud
import jieba
import jieba.analyse
import pymysql.cursors

# -*- coding:utf-8 -*-

#测试jieba分词

# str="我们一起去看电影，好不好，我们一起看电影吧，电影院不远，吃点火锅。"
# tongji = {}
# # seg_list = jieba.cut(str, cut_all=False)
# # print ("Default Mode:", "/ ".join(seg_list))  # 精确模式
#
# jieba.set_dictionary('testFC.txt')
# jieba.analyse.set_idf_path('testFC.txt')
# tags = list(jieba.analyse.extract_tags(str, topK=200, withWeight=True))
#
# try:
#     # jieba.analyse.set_stop_words('你的停用词表路径')
#     tags = jieba.analyse.extract_tags(str, topK=200, withWeight=True)
#     for v, n in tags:
#         # 权重是小数，为了凑整，乘了一万
#         if u'' + v in tongji:
#             tongji[u'' + v] = tongji[u'' + v] + int(n* 10000)
#         else:
#             tongji[u'' + v] = int(n * 10000)
# finally:
#     pass
#
# print( tags)
importlib.reload(sys)

tongji = {'怀孕': 178264, '出血': 46302, '感冒': 31503, '白癜风': 28335, '阴道炎': 25059, '流产': 22132, '手淫': 20096, '艾滋病': 17503, '腹痛': 12522, '早泄': 10558, '病毒感染': 10327, '咳嗽': 9613, '前列腺炎': 9327, '湿疹': 9322, '内分泌失调': 8940, '性病': 8693, '癫痫': 8648, '皮肤病': 8219, '尖锐湿疣': 7488, '呕吐': 7045, '妇科检查': 6914, '胃炎': 6843, '梅毒': 6733, '白斑': 6668, '包皮过长': 6622, '毛囊炎': 6604, '疲劳': 6407, '痤疮': 6362, '皮炎': 6336, '贫血': 6335, '先兆流产': 6266, '水肿': 6247, '焦虑': 6121, '头晕': 5858, '狂犬病': 5493, '头痛': 5438, '肝病': 5267, '消化不良': 5170, '腹泻': 5043, '精神紧张': 4895, '荨麻疹': 4756, '脱发': 4699, '鼻炎': 4681, '糖尿病': 4590, '阴道出血': 4585, '皮疹': 4191, '疱疹': 4085, '肠炎': 4043, '排卵期出血': 3948, '上呼吸道感染': 3929, '人工流产': 3877, '失眠': 3820, '痛经': 3732, '丘疹': 3554, '牛皮癣': 3528, '乏力': 3312, '乳腺增生': 3303, '银屑病': 3238, '高血压': 3186, '耳鸣': 3146, '龟头炎': 3077, '月经失调': 3027, '瘢痕': 3003, '尿道炎': 2975, '强直性脊柱炎': 2903, '喉炎': 2849, '肛裂': 2722, '腰痛': 2549, '红斑': 2521, '淋巴结肿大': 2462, '肝炎': 2437, '抑郁症': 2355, '鼻塞': 2355, '保留': 2196, '咽炎': 2196, '高热': 2130, '神经衰弱': 2127, '牙龈炎': 2075, '气管炎': 2067, '痉挛': 2012, '闭经': 2011, '结膜炎': 2008, '鸡眼': 2005, '腰肌劳损': 1966, '子宫内膜炎': 1858, '胸闷': 1797, '精索静脉曲张': 1794, '外阴炎': 1780, '肺炎': 1750, '粉刺': 1747, '尿痛': 1741, '包皮龟头炎': 1740, '舌苔': 1722, '血尿': 1706, '综合征': 1694, '黄疸': 1692, '早产': 1692, '破伤风': 1656, '痛风': 1649, '便血': 1641, '心理治疗': 1623, '盗汗': 1576, '细菌性阴道炎': 1565, '营养不良': 1556, '龋齿': 1531, '慢性咽炎': 1490, '鼻窦炎': 1447, '卵巢囊肿': 1444, '乳腺炎': 1439, '脓肿': 1419, '子宫内膜异位': 1408, '包茎': 1389, '湿疣': 1365, '脂溢性皮炎': 1362, '胃病': 1359, '慢性胃炎': 1359, '阑尾炎': 1351, '灰指甲': 1335, '带状疱疹': 1329, '中耳炎': 1309, '胃痛': 1308, '呼吸道感染': 1282, '口臭': 1261, '扁平疣': 1247, '胃肠功能紊乱': 1220, '股癣': 1205, '肾结石': 1202, '脂肪瘤': 1190, '内痔': 1188, '淋病': 1187, '胸痛': 1185, '肝硬化': 1158, '麦粒肿': 1155, '血管扩张': 1124, '滴虫性阴道炎': 1115, '牙周炎': 1107, '支原体感染': 1107, '水痘': 1097, '自然流产': 1094, '过敏性紫癜': 1087, '胃溃疡': 1055, '白带异常': 1049, '睾丸炎': 1015, '精囊炎': 1003, '脂肪肝': 1001, '紫癜': 995, '寻常疣': 991, '胆囊炎': 980, '外痔': 967, '眩晕': 965, '急性胃肠炎': 952, '雀斑': 950, '低血压': 946, '呼吸困难': 940, '嗜睡': 936, '口干': 934, '斜视': 925, '喷嚏': 925, '心脏病': 916, '心律失常': 915, '斑秃': 910, '消瘦': 900, '血管瘤': 900, '附睾炎': 894, '多囊卵巢综合征': 883, '冻疮': 865, '肝大': 847, '哮喘': 844, '抽搐': 841, '良性肿瘤': 838, '慢性前列腺炎': 829, '肛瘘': 822, '食欲不振': 808, '散光': 808, '结肠炎': 801, '过分担心': 799, '脂溢性脱发': 777, '心悸': 770, '接触性出血': 768, '胸膜炎': 753, '单纯疱疹': 753, '疥疮': 750, '偏头痛': 744, '牙龈出血': 741, '牙髓炎': 737, '霉菌感染': 729, '骨质增生': 722, '肠痉挛': 714, '气短': 710, '咽痛': 701, '精神分裂症': 698, '子宫出血': 690, '肛周脓肿': 690, '包皮炎': 687, '植物神经功能紊乱': 686, '背痛': 659, '精神病': 651, '肾病': 641, '淋巴结炎': 641, '肋间神经痛': 639}

#绘制词云图
wordcloud = WordCloud(font_path = "simfang.ttf",width=1920, height=1080,background_color = 'White').generate_from_frequencies(tongji)
wordcloud.to_file('20-30岁.png')
import matplotlib.pyplot as plt
plt.imshow(wordcloud, interpolation='bilinear')
plt.axis("off")
plt.show()